Revit 2027 API
PDFExportOptions.ReplaceHalftoneWithThinLines Property
 Whether to replace halftone with thin lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ReplaceHalftoneWithThinLines { get; set; }
Public Property ReplaceHalftoneWithThinLines As Boolean
	Get
	Set
public:
property bool ReplaceHalftoneWithThinLines {
	bool get ();
	void set (bool value);
}
member ReplaceHalftoneWithThinLines : bool with get, set
Property Value
Boolean
See Also
Reference
PDFExportOptions Class
Autodesk.Revit.DB Namespace